[
  "title: Reliquia | artist: ROSALÍA | mood: dreamy, melancholic | activity: daydreaming, crying, venting | genre: alternative, pop | vibe: cinematic, ethereal, melodic, airy, expansive\nSoft, climactic track with delicate yet powerful vocals and a floating, classical feel. Takes you around the world.",
  "title: Ice In My OJ | artist: Hayley Williams | mood: gritty, energetic | activity: walking, working out, reflecting | genre: rock, alternative | vibe: layered, dark, moody, expansive, distorted vocals, raw\nConstant rock beats with sprinkled explosive roughness, real talk from a powerful artist.",
  "title: Letting Go | artist: Calica | mood: uplifting, nostalgic, energetic | activity: commuting, cooking, relaxing, driving | genre: pop, indie | vibe: synthy, soft vocals, hypnotic, rhythmic, moody\nBright synths and driving beat that feel expansive, nostalgic, and full of momentum.",
  "title: Big Brown Eyes | artist: Lola Young | mood: gritty, energetic, uplifting | activity: working out, driving, venting | genre: alternative, indie | vibe: moody, rhythmic, intimate, raw\nFast-paced, rage diffusing tune that talks about a shitty ex.",
  "title: fanatsmas | artist: HUMBE | mood: calm, dreamy, nostalgic, warm, melancholic, hazy | activity: walking, relaxing, crying, reflecting, daydreaming | genre: pop, r&b, folk, mariachi | vibe: intimate, airy, hazy, acoustic, ethereal, melodic\nMariachi-inspired instruments and vulnerable Mexican Spanish male voice make you feel like you're flying through clouds while remembering loved ones.",
  "title: REM | artist: HUMBE | mood: calm, melancholic, nostalgic | activity: relaxing, late night, crying, reflecting, daydreaming | genre: pop, r&b, folk | vibe: cinematic, intimate, expansive, acoustic, layered, ethereal, melodic\nSong in Spanish has melismatic vocals that take you from soft places to soaring hights, while beat follows perfectly.",
  "title: How Easy | artist: Calica | mood: melancholic, warm, calm | activity: studying, walking, late night, crying, reflecting, venting | genre: indie, country, pop | vibe: intimate, warm, moody, acoustic, hypnotic\nModern country inspired sad song that ponders leaving a loved one that might be making you lose a part of yourself.",
  "title: La Perla | artist: ROSALÍA, Yahritza y Su Esencia | mood: dreamy, calm, uplifting | activity: cooking, relaxing, commuting, driving, daydreaming, venting | genre: pop, classical, flamenco | vibe: cinematic, expansive, airy, intimate, melodic, retro\nGenre-bending, satisfying and elegant ex-partner rant in Spanish. Two artists' voices blend perfectly, making you waltz in your mind.",
  "title: Sugar Talking | artist: Sabrina Carpenter | mood: frustrated, gritty | activity: studying, walking, late night, reflecting, venting | genre: pop, country, r&b | vibe: hazy, moody, layered, textured, raw\nSassy and sincere delivery of someone who knows what they want. Guitar strings in the right place make you feel a slow yet strong groove.",
  "title: All I Wanted | artist: Paramore | mood: melancholic, frustrated, nostalgic, energetic, gritty | activity: late night, working out, commuting, driving, venting | genre: pop, rock, alternative | vibe: expansive, hazy, moody, acoustic, textured, ethereal, raw\nSlow-burn that explodes into cathartic emotion, with vulnerable vocals and massive release. Feels like holding something in for too long and finally letting it go.",
  "title: Soy Easy (To Fall In Love) | artist: Olivia Dean | mood: warm, calm, uplifting | activity: cooking, relaxing, daydreaming, reflecting | genre: pop, r&b, soul | vibe: warm, intimate, soft vocals, melodic, minimal\nSmooth, reassuring vocals that are delivered with a warm sweetness. Makes vulnerability feel safe and sincere.",
  "title: Touch & Go | artist: Sedona | mood: dreamy, melancholic, nostalgic | activity: walking, late night, reflecting, daydreaming | genre: indie, pop | vibe: hazy, intimate, airy, soft vocals\nFloaty production and soft delivery that feels like a soundtrack to a 90s movie. Kind of like reviving a memory you never understood.",
  "title: Sugar | artist: Remi Wolf | mood: uplifting, energetic | activity: cooking, driving, daydreaming, late night | genre: pop | vibe: synthy, rhythmic, chaotic, retro, layered\nPlayful, punchy, and a little unhinged in a good way. Almost like seeing colors bouncing.",
  "title: Letting Go | artist: Calica | mood: uplifting, nostalgic, energetic | activity: commuting, cooking, relaxing, driving | genre: pop, indie | vibe: synthy, soft vocals, hypnotic, rhythmic, moody\nBright synths and a leading beat that feel full of momentum. Introspective by moving forward while still looking back.",
  "title: 3 AM | artist: HAIM | mood: nostalgic, energetic, uplifting | activity: driving, commuting, late night | genre: pop, rock | vibe: rhythmic, retro, textured, layered, intimate, soft vocals\nLate-night restlessness with a beat and sultry vocals that makes you feel cheeky. Deals with unresolved feelings that are still buzzing.",
  "title: Think Too Much | artist: Hannah Jadagu | mood: calm, dreamy, melancholic | activity: studying, walking, reflecting | genre: pop, indie | vibe: minimal, soft vocals, intimate\nSoft chants that convey the quiet spiral of overthinking. Gentle ear-candy that soothes, but kinda stings you.",
  "title: One Of The Greats | artist: Florence + The Machine | mood: uplifting, energetic, gritty | activity: working out, driving, venting, late night | genre: rock, alternative | vibe: cinematic, expansive, raw, chaotic, ethereal\nBig and unfiltered emotions delivered by Florence's classic hard-hitting dramatics. Makes you twirl endlessly while banging your head like her.",
  "title: Ego Death At A Bachelorette Party | artist: Hayley Williams | mood: frustrated, gritty, melancholic | activity: late night, reflecting, venting, driving | genre: alternative, rock | vibe: dark, raw, textured, intimate\nUncomfortable for some, brutally honest, and confrontational towards how the singer sees the world currently. Makes you face your insecurities as they are.",
  "title: Augustine | artist: Blood Orange | mood: dreamy, nostalgic, melancholic | activity: walking, late night, daydreaming, hazy, commuting | genre: r&b, indie | vibe: hazy, lo-fi, textured, cinematic\nPoem-like feel with melodic spoken words. Distant vocals create a surreal, floating atmosphere - signature Dev Hynes. Subtly incorporates Krio (language from Sierra Leone). Kinda makes you feel like you're in a small budget, indie movie.",
  "title: Half Mast | artist: Empire Of The Sun | mood: dreamy, uplifting, nostalgic | activity: driving, daydreaming, walking | genre: electronic, pop | vibe: futuristic, airy, synthy, expansive\nContrasting vocals - from almost nasally spoken to bright head voice create a mist of nostalgia. Feels like artist is trying to plea for someone to come back to their life.",
  "title: My Love | artist: Mariah Carey | mood: warm, nostalgic, calm, dreamy | activity: relaxing, daydreaming, reflecting | genre: pop, r&b, soul | vibe: melodic, soft vocals, intimate, minimal, retro\nClassic ballad feel with a heartfelt delivery that makes it feel timeless yet leaning into 'old-love-song' vibe. If you listen closely you can almost find a new instrument every time you hear this song again.",
  "title: In Your Feelings | artist: Mariah Carey | mood: frustrated, gritty, melancholic | activity: venting, driving, reflecting, late night | genre: r&b, pop, soul | vibe: textured, moody, raw, melodic, intimate, soft vocals\nClassic Mariah, but now with a mature tone. Tempo change is very pleasing and the instruments highlight every word's meaning. Highlights awareness of a relationship's decline but not necessarily knowing how they got there. Makes you want to move on, while being just a bit reluctant.",
  "title: Catching Bodies | artist: Sekou | mood: gritty, energetic, uplifting | activity: working out, venting, driving, late night | genre: soul, r&b | vibe: dark, rhythmic, raw, chaotic, retro\nSekou knows what he wants and is aware of temptation. Has sort of a retro energy and sharp delivery that hits hard and consistently with each beat. Made to move through anger, not around it.",
  "title: Caesar in a TV Screen - Ides of March Version | artist: The Last Dinner Party | mood: gritty, energetic, frustrated | activity: venting, working out, driving, cooking | genre: alternative, rock, indie | vibe: chaotic, raw, cinematic, expansive, dark, ethereal\nTheatrical energy, artists seems comment on a specific male performer persona and how public perceives it. Song deal with insecurities and hypothetics. Sound builds as tempo picks up and the artist's voice fills the room.",
  "title: Throw Down | artist: Fleetwood Mac | mood: gritty, energetic, frustrated | activity: driving, venting, late night, reflecting | genre: rock, pop | vibe: textured, rhythmic, raw, retro\nTension builds as soon as you hear Stevie. As Lindsey joins, you feel the resentment as if it was yours. Like a confrontation you’ve been rehearsing in your head.",
  "title: Calling After Me | artist: Wallows | mood: nostalgic, melancholic, dreamy, energetic | activity: walking, late night, reflecting, daydreaming, commuting | genre: pop, indie | vibe: hazy, textured, melodic, synthy, distorted vocals\nLonging weirdly well matched with uptempo beat - jangly guitars and synth sound makes it fresh. Expresses the excitement of the initial 'chase' between two people.",
  "title: Fire & Lightning | artist: Fulton Lee, Karen Linette | mood: dreamy, melancholic, warm, gritty | activity: relaxing, reflecting, daydreaming, venting | genre: r&b, indie, soul | vibe: intimate, acoustic, ethereal, melodic, hypnotic\nStripped-back production that feels emotional and powerful. Their voices is like liquid fire, hitting ear-candy high notes and sparking some static as some rasp appears to shock you.",
  "title: No One's Watching Me | artist: Ezra Collective, Olivia Dean | mood: warm, uplifting, calm | activity: late night, relaxing, daydreaming, reflecting, venting | genre: jazz, soul, r&b | vibe: warm, rhythmic, intimate, melodic, layered\nLoose, cheeky collaboration that feels unguarded and connected with someone. Sax and Olivia's voice make you feel the comfort of being yourself when no one’s looking.",
  "title: Let Me Love You | artist: Amber Mark | mood: warm, melancholic, dreamy, uplifting | activity: late night, reflecting, relaxing, walking | genre: r&b, soul | vibe: soft vocals, intimate, airy, melodic, raw, ethereal\nVelvety vocals that have an earthy edge by Amber. Great for strutting when having somewhere to go. Calm convitcion of connection with someone.",
  "title: The Scythe | artist: The Last Dinner Party | mood: gritty, dark, frustrated, nostalgic, melancholic | activity: venting, late night, reflecting, driving, crying | genre: alternative, rock, indie | vibe: chaotic, cinematic, raw, dark, ethereal\nHeavy and dramatic storytelling that feels mythical and personal. Anger and vulnerability clash while almost time-travelling to your last days and talking with loved ones for the last time.",
  "title: Glum | artist: Hayley Williams | mood: melancholic, frustrated, gritty | activity: reflecting, venting, late night, driving | genre: rock, alternative | vibe: raw, intimate, minimal, dark, distorted voice\nHigh-pitched Hayley, amlost child-like, acts as your intrusive thoughts while normal Hayley gives you hard truths. Makes you sit with feelings you usually avoid.",
  "title: Parachute | artist: Hayley Williams | mood: dreamy, melancholic, energetic, gritty | activity: late night, relaxing, reflecting | genre: rock, alternative, pop | vibe: ethereal, soft vocals, airy, intimate, raw\nCrystal clear vocals that keep you company while free falling and feel all the feels, even before her voice intentionally goes more grungey. Head banging and mouthing 'I thought you were gonna catch me.'",
  "title: who's your boyfriend | artist: Royel Otis | mood: energetic, dreamy, gritty | activity: driving, walking, late night, cooking | genre: indie, alternative, pop | vibe: retro, rhythmic, textured, moody\nBouncy tension with a jealous sub-layer. Sounds playful, but feelings related to something unresolved are brewing.",
  "title: Vampire Bat | artist: Glass Animals | mood: dreamy, gritty, energetic | activity: driving, late night, daydreaming, reflecting | genre: electronic, pop, alternative | vibe: futuristic, layered, textured, chaotic, synthy, distorted vocals, hypnotic\nSticky hooks and whimsical production - classic yet 100% satisfying Glass Animals. Like being orbiting around someone else’s strange world.",
  "title: say something | artist: Royel Otis | mood: melancholic, dreamy, nostalgic, energetic, frustrated | activity: walking, reflecting, daydreaming, commuting | genre: indie, alternative, pop | vibe: hazy, intimate, soft vocals, acoustic, rhythmic\nMuted insecurity and overthinking that becomes in pleading out loud (or is it just in your head?). Like practicing a script to confront someone.",
  "title: undressed | artist: sombr | mood: melancholic, dreamy, warm, frustrated | activity: late night, reflecting, relaxing, venting, driving | genre: indie, pop, rock | vibe: intimate, minimal, soft vocals, moody, cinematic, retro\nBare and vulnerable delivery by an almost echo of a voice - yet it feels exposed. Kinda feels like bad communication led to distance between people in a relationship coming to an end.",
  "title: Nothing Matters | artist: The Last Dinner Party | mood: energetic, uplifting, gritty, melancholic | activity: working out, venting, driving | genre: alternative, rock, indie | vibe: cinematic, chaotic, expansive, raw, ethereal\nFirm confidence paired with reckless release - the artist's voice feels famliar even to the unfamiliar ear. Feels like doing what it takes, without caring for the consequences, just to feel free and the guitar, keys, trumpet, and drums fuel this feeling.",
  "title: Midnight Sun | artist: Zara Larsson | mood: uplifting, dreamy, energetic, warm | activity: driving, cooking, daydreaming, working out | genre: pop, electronic | vibe: synthy, airy, expansive, melodic, cinematic, futuristic\nSparkly pop production that feels hopeful and endless. Like chasing light when it’s about to fade, and doing it all over in a loop.",
  "title: Color Esperanza | artist: Diego Torres | mood: uplifting, energetic, warm, nostalgic | activity: driving, commuting, cooking, working out, studying | genre: pop, rock | vibe: melodic, rhythmic, expansive, warm, retro\nConsistent percussion drives an optimistic feeling. If you know Spanish, the lyrics bring the sun on a cloudy day. Makes you motivated.",
  "title: Fame is a Gun | artist: Addison Rae | mood: energetic, uplifting, gritty | activity: driving, working out, late night, venting, walking | genre: pop, electronic | vibe: synthy, rhythmic, futuristic, layered, textured, soft vocals, distorted vocals\nAddison takes this 'cool girl' persona and delivers high tempo pitched vocals. Talks about dangers of the spotlight but makes you indulge.",
  "title: When I Feel It | artist: Mariah Carey | mood: warm, nostalgic, calm | activity: late night, relaxing, reflecting, daydreaming | genre: r&b, pop, soul | vibe: melodic, soft vocals, intimate, layered, textured, retro\nBond movie feeling by sampling The Dyamic Suepriors. Conveys powerful but controlled emotions, that you feel directed to you. Makes you wanna bop.",
  "title: don't wanna break up again | artist: Ariana Grande | mood: melancholic, frustrated, dreamy | activity: late night, reflecting, venting, driving, working out | genre: pop, r&b | vibe: airy, soft vocals, melodic, textured, moody, layered\nSoft, direct honesty that feels pretty while it hurts. Like you already know something's gonna end, but you’re trying to slow it down.",
  "title: Angel of Mine | artist: Monica | mood: warm, nostalgic, melancholic, calm | activity: late night, relaxing, crying, reflecting | genre: r&b, soul, pop | vibe: soft vocals, melodic, intimate, minimal, retro, warm\nPure, classic R&B tune that covers strong feelings for someone who has had great impact in your life. Monica's sweet voice hits like a love letter.",
  "title: Che strano amore questo amore | artist: Pino D'Angiò | mood: energetic, warm, uplifting | activity: cooking, driving, late night, walking | genre: pop | vibe: retro, rhythmic, layered, synthy, textured\nPlayful, strut-inducing groove with an old-school Italian swag. Feels like dancing through a messy crush with a cheeky smirk.",
  "title: Corazón Partío | artist: Alejandro Sanz | mood: melancholic, nostalgic, gritty | activity: driving, venting, late night, reflecting | genre: pop, flamenco | vibe: acoustic, melodic, raw, textured, retro\nHeartbreak that cuts clean, carried by a Spanish guitar and a husky voice that really means it. Feels dramatic in a good way, making you want sing at the top of your lungs.",
  "title: Little Things | artist: KARLEE GIRL | mood: dreamy, nostalgic, warm, uplifting | activity: walking, studying, reflecting, daydreaming | genre: indie, pop | vibe: soft vocals, intimate, minimal, hazy, melodic\nGentle, introspective, and bouncy, like noticing small details with big meanings. Soft enough to focus, but emotional enough to linger.",
  "title: Garota de Ipanema | artist: Paula Sergio | mood: calm, warm, nostalgic | activity: cooking, relaxing, daydreaming, reflecting, studying | genre: jazz, pop | vibe: acoustic, melodic, minimal, airy, retro\nEasy, timeless sway sound that makes the room melt. Portuguese sounds especially endearing here - makes you want to live in slo-mo while enjoying your day.",
  "title: Where Have You Been | artist: Kelly Clarkson | mood: energetic, uplifting, frustrated, gritty | activity: working out, driving, venting, commuting | genre: pop, rock | vibe: expansive, cinematic, raw, textured, melodic, moody\nOut of this world voice conveys big feelings, zero holding back. Feels like turning confusion into strength and letting it echo in the stratospheric climax.",
  "title: Headphones On | artist: Addison Rae | mood: uplifting, energetic, dreamy | activity: walking, commuting, driving, late night | genre: pop, electronic | vibe: synthy, futuristic, rhythmic, airy, layered, cinematic\nEscapist pop that makes you enter your own little movie. Light and shiny but deep if you listen closer. Made for moving through the city and observing.",
  "title: Something Heavy | artist: Sam Fender | mood: melancholic, gritty, energetic | activity: driving, late night, reflecting, venting | genre: rock, indie | vibe: raw, textured, expansive, melodic, cinematic\nSincere rock that feels like carrying an unknown weight and ponder about the world. Builds until you want to scream-sing in the car.",
  "title: People Watching | artist: Sam Fender | mood: nostalgic, melancholic, energetic | activity: walking, commuting, driving, reflecting | genre: rock, indie | vibe: textured, melodic, raw, expansive, retro\nDeep and emotional song that talks about missing your past self while looking outward. And yet makes you fully cognizant that evryone lives in their own little world. Sam's voice and deliverable makes it highly relatable.",
  "title: Blade Of Grass | artist: Lady Gaga | mood: warm, melancholic, nostalgic, calm | activity: late night, reflecting, crying, relaxing | genre: pop, country | vibe: acoustic, soft vocals, intimate, melodic, minimal, warm\nQuiet devotion that feels grounded and real, like love without performance. Simple and tender in a way that sneaks up on you.",
  "title: Vanish Into You | artist: Lady Gaga | mood: uplifting, energetic, dreamy, warm | activity: driving, working out, late night, daydreaming, cooking | genre: pop | vibe: synthy, futuristic, expansive, rhythmic, layered\nRaw pop that makes you feel raw emotions as Gaga's piercing honest rapsy tone goes sits on the mid-high belts. Big hooks and a floaty rush that makes you forget your own thoughts and want the kind of love she sings about.",
  "title: Lost on You | artist: LP | mood: melancholic, gritty, nostalgic | activity: driving, venting, late night, reflecting, studying | genre: rock, alternative, indie | vibe: raw, acoustic, textured, melodic, expansive\nRasp and heartbreak that feel yours. Like admitting you miss someone while pretending you don’t.",
  "title: Photograph | artist: Def Leppard | mood: nostalgic, gritty, energetic | activity: driving, late night, reflecting, daydreaming, venting | genre: rock | vibe: retro, melodic, textured, expansive, raw\nTextbook great rock song that talks about longing that feels like going through memories you need to relive. Big chorus, very car-ride worthy.",
  "title: Tu Carcel | artist: Los Enanitos Verdes | mood: melancholic, nostalgic, gritty, frustrated | activity: driving, late night, venting, reflecting, cooking | genre: rock, pop | vibe: retro, melodic, raw, textured, acoustic\nOld-school heartbreak in Spanish that deals with being left but highlights how the other person might be somewhat misserable. Feels like singing pain out loud makes it a little lighter.",
  "title: Black Hole | artist: Griff | mood: energetic, uplifting, frustrated | activity: driving, commuting, working out, late night, dark | genre: pop, alternative | vibe: synthy, futuristic, rhythmic, layered, textured, raw\nElbowing obstacles to move forward while the lyrics spiral a bit. Feels like getting pulled in, but choosing to escape.",
  "title: last night's mascara | artist: Griff | mood: melancholic, dreamy, nostalgic | activity: late night, reflecting, venting, walking, dark | genre: pop, alternative | vibe: hazy, soft vocals, intimate, textured, melodic\nSoft sadness with a glossy finish, makes you want to feel acknowledged and valued by someone who hasn't in the past. Feels like replaying a night you wish you could re-do.",
  "title: Labios Compartidos | artist: Maná | mood: melancholic, nostalgic, gritty, frustrated | activity: driving, late night, venting, reflecting | genre: rock, pop | vibe: melodic, raw, textured, retro, expansive\nLatin rock talking exploring heartbreak and jealousy in a poetic way. Like you’re arguing with your own memories as you relive them.",
  "title: The Crying Room | artist: The Yagas | mood: melancholic, gritty, frustrated | activity: late night, reflecting, venting, driving | genre: alternative, rock | vibe: dark, raw, textured, layered, melodic, ethereal, cinematic\nHeavy mood that draws you slowly, self-reflective in the sense that surfaces feelings you’ve been avoiding. The tension stays in your chest and then cracks open with Vera's ghostly wails.",
  "title: Akira | artist: MICHELLE | mood: energetic, uplifting, dreamy | activity: walking, commuting, driving, daydreaming | genre: indie, pop | vibe: layered, textured, rhythmic, synthy, melodic, chaotic\nBouncy, colorful cheeky chaos that also feels clean and intentional. Makes you visualize a fast montage of a future decision chain.",
  "title: ROCKMAN | artist: Mk.gee | mood: dreamy, gritty, melancholic, nostalgic | activity: late night, walking, reflecting, daydreaming | genre: alternative, indie | vibe: textured, hypnotic, lo-fi, layered, distorted vocals, dark\nHazy guitar strings with vocals that feel like they’re coming from another room. Comforting, like sinking into a thought you don’t want to leave.",
  "title: Spotlight | artist: Jennifer Hudson | mood: uplifting, energetic, gritty, frustrated | activity: driving, venting, working out, commuting | genre: pop, soul, r&b | vibe: cinematic, expansive, melodic, raw, textured\nBig voice and feelings from Jennifer, zero apologies. Empowering and helps you with confidence, let it blast through the speakers.",
  "title: Fantasy | artist: JADE | mood: energetic, uplifting, warm | activity: driving, working out, cooking, late night | genre: pop, alternative, r&b | vibe: synthy, rhythmic, futuristic, layered, airy\nGlimmering pop rush that encourages self-acceptance in a cheeky way. Fun and light but you can for sure bop to it.",
  "title: Happy Mistake | artist: Lady Gaga | mood: melancholic, warm, nostalgic | activity: late night, reflecting, relaxing, crying | genre: pop, rock | vibe: intimate, melodic, soft vocals, minimal, textured, raw\nTakes you on a journey. Gaga starts tender and honest and then goes into room-filling rawness. Like admitting you miss something that hurt you.",
  "title: Don't Let Me Get Me | artist: P!nk | mood: energetic, gritty, frustrated | activity: working out, venting, driving, commuting | genre: pop, rock | vibe: raw, rhythmic, textured, melodic, retro\nStraight up self-sabotage with a punchy kick. Feels like laughing at your own mess while still kinda spiraling.",
  "title: Ojos Noche | artist: Elsa y Elmar | mood: dreamy, melancholic, warm | activity: late night, reflecting, daydreaming, walking | genre: pop, indie | vibe: hazy, intimate, soft vocals, melodic, minimal\nSoft Spanish pop that feels like whispering a secret you’ve been holding onto to someone you trust. Warm but a little haunted in a pretty way.",
  "title: we can't be friends | artist: Ariana Grande | mood: melancholic, dreamy, frustrated | activity: late night, reflecting, venting, walking, crying | genre: pop, r&b | vibe: airy, soft vocals, melodic, layered, moody, ethereal\nMakes you appreciate sadness, slowly accepting it. Like you’re trying to be mature about it, but it still stings every time.",
  "title: Nivel Dios | artist: Yahritza Y Su Esencia, Michelle Maciel | mood: gritty, melancholic, nostalgic | activity: driving, late night, reflecting, venting | genre: folk, pop | vibe: melodic, raw, textured, intimate, acoustic\nEmotional Spanish vocals that feel direct and unfiltered. They are finally saying the hard part out loud, after long moping.",
  "title: Don't Smile | artist: Sabrina Carpenter | mood: frustrated, gritty, melancholic, nostalgic | activity: late night, reflecting, venting, walking, crying | genre: pop | vibe: moody, textured, layered, melodic, raw\nA calm kind of irkness, like you’re done being polite about it and cut the bullshit. The bite is subtle, but it’s definitely there.",
  "title: Eyes Without A Face | artist: Billy Idol | mood: nostalgic, dreamy, gritty | activity: driving, late night, daydreaming, reflecting, crying | genre: rock | vibe: retro, hypnotic, textured, melodic, dark\nIconic 80s mood that feels romantic but a little eerie. Like looking staraight at someone you can’t read, and still wanting more.",
  "title: Picture You | artist: Chappell Roan | mood: dreamy, nostalgic, melancholic | activity: late night, reflecting, daydreaming, walking, crying | genre: pop | vibe: cinematic, melodic, layered, textured, soft vocals, moody\nBig feelings being spoken softly in a movie scene in your head. Feels like wanting someone so bad you turn it into art.",
  "title: LENTO | artist: Cami | mood: dreamy, melancholic, warm | activity: late night, reflecting, relaxing, daydreaming, venting | genre: pop | vibe: intimate, soft vocals, melodic, airy, minimal\nSlow and close, like she’s singing right next to you. Makes you feel vulnerable but wanting control over how a hearbreak unflods.",
  "title: Diggin' On You | artist: TLC | mood: warm, uplifting, calm | activity: cooking, relaxing, driving, daydreaming, studying | genre: r&b, soul | vibe: retro, rhythmic, soft vocals, melodic, warm, layered\nSmooth classic R&B that feels like waking up to sunlight through blinds. Flirty, effortless, and makes you move without thinking.",
  "title: in your hands | artist: Halle | mood: dreamy, warm, melancholic | activity: late night, reflecting, relaxing, daydreaming | genre: r&b, soul | vibe: ethereal, soft vocals, intimate, melodic, airy, dark\nHalle delivers dark fairy tale vocals that state someone's reality after they lose you. The relationship dynamic is interesting, as she acknowledges she is what makes her partner great.",
  "title: El Sol No Regresa | artist: La Quinta Estación | mood: uplifting, energetic, nostalgic | activity: driving, commuting, cooking, working out | genre: pop, rock | vibe: melodic, rhythmic, retro, expansive, textured\nUpbeat Spanish pop-rock with a dramatic shine that makes you feel like you’re running from heartbreak, but somewhat hopeful. Built for loud car singing.",
  "title: White Roses | artist: Glass Animals | mood: dreamy, hazy, melancholic | activity: late night, daydreaming, reflecting, driving | genre: electronic, alternative, pop | vibe: layered, textured, hypnotic, futuristic, distorted vocals\nSticky, floaty production that feels like being half-awake in a neon dream. The groove pulls you in while the lyrics keep you slightly unsettled.",
  "title: Ring My Bell | artist: Anita Ward | mood: uplifting, energetic, warm | activity: cooking, driving, late night, walking | genre: disco, soul, pop | vibe: retro, rhythmic, groovy, melodic, warm\nClassic disco flirtiness with a timeless bounce. Instant mood lift that makes you move without asking permission.",
  "title: Eyes on my baby | artist: BETWEEN FRIENDS | mood: dreamy, uplifting, energetic | activity: walking, commuting, driving, late night | genre: pop, electronic, indie | vibe: synthy, airy, layered, rhythmic, hazy\nCute and upbeat with a soft roundness, like being confident and crushy at the same time. Feels like city lights and texting too fast.",
  "title: un día | artist: Lara91k, Julieta Venegas | mood: melancholic, nostalgic, dreamy | activity: late night, reflecting, daydreaming, walking | genre: pop, indie | vibe: melodic, soft vocals, hazy, intimate, textured\nSpanish-language melancholy that feels gentle but very direct. Like replaying a conversation you wish you could redo, slower this time.",
  "title: Love Of My Life | artist: Harry Styles | mood: nostalgic, melancholic, warm | activity: driving, late night, reflecting, daydreaming | genre: pop, rock | vibe: melodic, textured, retro, intimate, warm\nBittersweet and reminescent, like missing someone while pretending it’s fine. Feels like end of a chapter, nostalgic.",
  "title: GO STUPID | artist: Julia Cooper | mood: energetic, uplifting, gritty | activity: working out, driving, venting, late night | genre: pop, electronic | vibe: chaotic, synthy, rhythmic, futuristic, textured\nUnhinged pop confidence that makes you feel fearless for three minutes. Like choosing chaos on purpose and loving it.",
  "title: Girl, so confusing | artist: Charli XCX, Lorde | mood: frustrated, gritty, energetic | activity: driving, late night, venting, walking | genre: pop, electronic | vibe: textured, layered, chaotic, synthy, raw\nDeals with messy feelings with a glossy punch, like overthinking in bathroom mirror. Sharp, direct, and weirdly freeing.",
  "title: L'AMOUR DE MA VIE [OVER NOW EXTENDED EDIT] | artist: Billie Eilish | mood: energetic, gritty, frustrated | activity: driving, late night, venting, working out | genre: pop, electronic | vibe: layered, textured, futuristic, cinematic, hypnotic, chaotic\nSwitches from cold emotion to full release, like flipping slow motion chaos. Feels like finally being over it and still wanting them to know.",
  "title: Dive | artist: Olivia Dean | mood: warm, calm, uplifting | activity: cooking, relaxing, daydreaming, reflecting | genre: r&b, soul, pop | vibe: soft vocals, melodic, intimate, warm, minimal\nSmooth and reassuring, like someone talking you down in a sweett way. Makes love feel safe and steady.",
  "title: A Warning | artist: Wallows | mood: nostalgic, melancholic, energetic | activity: walking, commuting, driving, reflecting | genre: indie, pop, rock | vibe: textured, melodic, rhythmic, retro, layered\nJangly and urgent, like realizing the red flags too late but still wanting to run toward it. Feels like a fast walk with loud thoughts.",
  "title: Made for Me | artist: Muni Long, Mariah Carey | mood: warm, uplifting, dreamy | activity: cooking, driving, late night, daydreaming | genre: r&b, soul | vibe: melodic, soft vocals, intimate, warm, layered\nRomantic r&b that feels like being chosen on purpose. Smooth vocals with that classic glow that makes you want to text someone you miss.",
  "title: SWEET N SOUR | artist: Julia Cooper | mood: energetic, uplifting, gritty | activity: driving, working out, late night, venting | genre: pop, electronic | vibe: synthy, rhythmic, textured, chaotic, layered\nSugar rush pop with a punch, like smiling while you’re plotting your comeback. Loud, fast, and kinda addictive.",
  "title: Every Little Thing I Say I Do | artist: Dayglow | mood: uplifting, energetic, warm | activity: walking, commuting, driving, cooking | genre: indie, pop | vibe: retro, rhythmic, melodic, warm, textured\nBright tune that feels like a clean slate and fresh air. Makes you want to walk faster and believe things will work out.",
  "title: Maria | artist: Dua Lipa | mood: energetic, uplifting, warm | activity: driving, working out, cooking, late night | genre: pop, disco | vibe: retro, rhythmic, groovy, layered, melodic\nConfident pop-disco bounce that feels like strutting with determination. Recognized the impact of that a third person had on someone's live. Smooth hooks that make you feel unstoppable.",
  "title: Watcha Doing | artist: Dua Lipa | mood: uplifting, energetic, flirty | activity: driving, walking, late night, cooking | genre: pop, disco | vibe: rhythmic, retro, groovy, melodic, layered\nPlayful, flirty energy that feels like a late-night text you actually send. Light, bouncy, and made for moving.",
  "title: Bourgeoisieses | artist: Conan Gray | mood: frustrated, gritty, energetic | activity: driving, venting, late night, working out | genre: pop, alternative | vibe: raw, textured, cinematic, layered, moody\nSharp and dramatic, like turning bitterness into a performance you can dance to. Feels like calling out the world while still wanting to belong.",
  "title: Never Ending Song | artist: Conan Gray | mood: nostalgic, uplifting, energetic | activity: driving, commuting, walking, late night | genre: pop | vibe: retro, rhythmic, melodic, layered, textured\nSparkly pop nostalgia that feels like the first seconds of a crush. Catchy in a way that loops in your head like it’s on purpose.",
  "title: This Kiss | artist: Faith Hill | mood: uplifting, energetic, warm | activity: driving, cooking, commuting, daydreaming | genre: country, pop | vibe: melodic, rhythmic, retro, warm, expansive\nPure sunshine country-pop that feels like windows down and zero problems. Makes romance feel easy and a little cheesy but enjoyable.",
  "title: II MOST WANTED | artist: Beyoncé, Miley Cyrus | mood: nostalgic, melancholic, warm | activity: driving, late night, reflecting, daydreaming | genre: country, pop | vibe: acoustic, melodic, textured, expansive, warm\nRoad-trip friendship and loyalty with a bittersweet edge. Feels like riding into the sunset with someone who actually gets you.",
  "title: Rave Angel | artist: Blusher | mood: energetic, uplifting, dreamy | activity: driving, late night, working out, walking | genre: pop, electronic | vibe: synthy, futuristic, rhythmic, layered, airy, textured\nGlittery club-pop rush that feels like levitating in flashing lights. Big hooks, floaty production, and pure main-character momentum.",
  "title: Limelight | artist: Blusher | mood: uplifting, energetic, warm | activity: driving, commuting, walking, working out | genre: pop, electronic | vibe: synthy, rhythmic, layered, textured, cinematic, futuristic\nShiny pop confidence that feels like stepping into the spotlight on purpose. Clean, bouncy beat that makes you walk faster without noticing.",
  "title: Change | artist: FLO | mood: warm, uplifting, melancholic | activity: late night, reflecting, driving, relaxing | genre: r&b, pop | vibe: soft vocals, melodic, intimate, layered, warm, textured\nSmooth modern R&B that feels honest without being dramatic. Like accepting something is shifting, even if you still wish it didn’t.",
  "title: imperfect for you | artist: Ariana Grande | mood: warm, dreamy, melancholic | activity: late night, reflecting, daydreaming, relaxing | genre: pop, r&b | vibe: airy, soft vocals, intimate, minimal, melodic, hazy\nTender, close-up vocals that feel like a quiet confession. Soft love with a realistic tone, like choosing each other anyway.",
  "title: Goddess | artist: Laufey | mood: warm, nostalgic, dreamy | activity: relaxing, late night, daydreaming, reflecting | genre: jazz, pop | vibe: acoustic, melodic, intimate, soft vocals, retro, minimal\nVelvet jazz-pop that feels like candlelight burning slow. Romantic in a composed way, like elegance you can actually breathe in.",
  "title: eternal sunshine | artist: Ariana Grande | mood: melancholic, dreamy, nostalgic | activity: late night, reflecting, driving, daydreaming | genre: pop, r&b | vibe: airy, layered, melodic, textured, moody, cinematic\nBittersweet pop that feels bright on the surface but heavy underneath. Like trying to move forward while your heart keeps rewinding.",
  "title: Chocolatito | artist: Pol Granch | mood: uplifting, energetic, warm | activity: cooking, driving, walking, late night | genre: pop, latin | vibe: rhythmic, retro, textured, melodic, playful\nFlirty Spanish pop with a cheeky bounce and sweet swagger. Feels like dancing around the kitchen with a grin you can’t hide.",
  "title: Heladito | artist: Kali Uchis | mood: dreamy, warm, uplifting | activity: driving, late night, cooking, daydreaming | genre: r&b, latin, pop | vibe: hazy, soft vocals, melodic, layered, textured, intimate\nSweet and silky like melting candy. Kali’s voice floats over a groove that’s chill but still addictive, like a slow summer night.",
  "title: Se Me Olvidó | artist: Gian Marco | mood: melancholic, nostalgic, warm | activity: late night, reflecting, crying, driving | genre: pop, latin | vibe: acoustic, melodic, intimate, raw, warm, textured\nClassic Latin ballad sadness that feels personal. Like remembering something you pretended you forgot, and it hits again.",
  "title: Tu Misterioso Alguien | artist: Miranda! | mood: energetic, uplifting, dreamy | activity: driving, late night, walking, cooking | genre: pop, electronic | vibe: synthy, retro, rhythmic, layered, airy, playful\nCatchy electro-pop drama with a wink. Feels like dancing through jealousy for someone you aren't sure exists.",
  "title: Te Mentiría | artist: Gian Marco | mood: melancholic, nostalgic, frustrated | activity: late night, reflecting, venting, driving | genre: pop, latin | vibe: melodic, raw, textured, acoustic, intimate\nHeartbreak with a steady pulse, like holding your voice together while you admit the truth. Emotional but controlled, built for late-night replay.",
  "title: Tummy Hurts | artist: Reneé Rapp, Coco Jones | mood: melancholic, frustrated, gritty | activity: late night, reflecting, venting, driving | genre: r&b, pop | vibe: raw, melodic, textured, intimate, layered\nGut-punch honesty that feels too real, in the best way. Big vocals meet emotional messiness, like saying what you usually swallow.",
  "title: Mil Horas | artist: Los Abuelos De La Nada | mood: nostalgic, energetic, melancholic | activity: driving, late night, commuting, venting | genre: rock, latin | vibe: retro, melodic, raw, textured, rhythmic\nClassic Argentinian rock nostalgia that makes you sing before you realize you’re emotional. Feels like late nights, cigarettes, and memories you can’t quit.",
  "title: Loco | artist: Andrés Calamaro | mood: gritty, nostalgic, energetic | activity: driving, late night, venting, walking | genre: rock, latin | vibe: raw, retro, melodic, textured, rhythmic\nLoose, swaggering rock that feels like chaos with charm. Like you’re a mess, you know it, and you’re still walking like you’re fine.",
  "title: Un Vino, Una Cerveza | artist: Pedro Suárez-Vértiz | mood: nostalgic, warm, melancholic | activity: cooking, driving, late night, reflecting | genre: rock, pop, latin | vibe: melodic, retro, textured, warm, raw\nPeruvian classic that feels like talking through heartbreak over drinks. Casual and poetic at the same time, like memory turned into a singalong.",
  "title: Cuéntame | artist: Pedro Suárez-Vértiz | mood: nostalgic, melancholic, warm | activity: driving, late night, reflecting, venting | genre: rock, pop, latin | vibe: melodic, retro, textured, raw, expansive\nEmotional rock-pop that feels like asking questions you already know the answer to. Built for loud singing when you need it out of your system.",
  "title: Alive | artist: Cynthia Erivo | mood: uplifting, energetic, warm | activity: working out, driving, commuting, venting | genre: pop, soul | vibe: cinematic, expansive, melodic, raw, textured\nBig voice, big surge of life. Feels like turning pain into power and letting it fill the whole room.",
  "title: Glowing Up | artist: Cynthia Erivo | mood: uplifting, energetic, confident | activity: working out, driving, walking, commuting | genre: pop, soul, r&b | vibe: rhythmic, melodic, textured, layered, warm\nInspiring energy with heart behind it. Like choosing yourself, dressing well, and stepping outside like the world owes you space.",
  "title: Intrusive Thoughts | artist: Natalie Jane | mood: frustrated, energetic, gritty | activity: late night, venting, driving, working out | genre: pop, electronic | vibe: textured, layered, chaotic, synthy, moody\nFast pop spiral that feels like your brain won’t shut up. Catchy in a way that makes the chaos feel weirdly fun.",
  "title: Again | artist: Lenny Kravitz | mood: nostalgic, melancholic, warm | activity: late night, reflecting, driving, daydreaming | genre: rock | vibe: melodic, textured, raw, retro, expansive\nSmooth rock longing with that classic ache. Feels like admitting you’d do it all over again, even knowing how it ends.",
  "title: In My Room | artist: Troye Sivan, Guitarricadelafuente | mood: dreamy, warm, melancholic | activity: late night, daydreaming, reflecting, relaxing | genre: pop, indie | vibe: intimate, soft vocals, acoustic, hazy, melodic, textured\nClose and tender, like a secret you don’t want to translate. Soft vocals and guitar warmth that feels like staying in with your feelings on purpose.",
  "title: What's The Time Where You Are? | artist: Troye Sivan | mood: nostalgic, melancholic, dreamy | activity: late night, reflecting, walking, daydreaming | genre: pop | vibe: hazy, melodic, intimate, layered, textured\nLong-distance longing that feels gentle but constant. Like checking the clock just to feel closer to someone you miss.",
  "title: Fotografía | artist: Juanes, Nelly Furtado | mood: nostalgic, melancholic, warm | activity: driving, late night, reflecting, daydreaming | genre: pop, rock, latin | vibe: melodic, acoustic, textured, warm, retro\nMemory-heavy duet that feels like flipping through old photos you promised you wouldn’t. Sweet and sad in the same breath, built for singing along.",
  "title: Lamento Boliviano | artist: Los Enanitos Verdes | mood: nostalgic, melancholic, gritty | activity: driving, late night, venting, reflecting | genre: rock, latin | vibe: retro, raw, melodic, textured, rhythmic\nClassic Latin rock sadness that somehow feels good to shout. Like turning heartbreak into a chant and letting it carry you.",
  "title: From The Start | artist: Laufey | mood: warm, uplifting, nostalgic | activity: cooking, relaxing, daydreaming, walking | genre: jazz, pop | vibe: retro, melodic, acoustic, soft vocals, rhythmic, intimate\nFlirty jazz-pop sweetness that feels like a crush you can’t hide. Light and charming, like smiling at someone and hoping they notice.",
  "title: Bewitched | artist: Laufey | mood: dreamy, melancholic, nostalgic | activity: late night, reflecting, daydreaming, crying | genre: jazz, pop | vibe: acoustic, melodic, intimate, soft vocals, retro, minimal\nRomantic ache that feels soft but deep, like being under a spell you don’t want to break. Elegant melodies that linger after the song ends.",
  "title: How Can I Make It Ok? | artist: Wolf Alice | mood: melancholic, gritty, nostalgic | activity: late night, reflecting, driving, venting | genre: alternative, rock, indie | vibe: textured, expansive, raw, moody, layered, cinematic\nSoft-to-loud emotional crash that feels like trying to fix something that’s already breaking. Dreamy guitars with a heavy weight underneath.",
  "title: Frágil | artist: Yahritza Y Su Esencia, Grupo Frontera | mood: melancholic, nostalgic, warm | activity: late night, reflecting, driving, crying | genre: folk, pop | vibe: acoustic, melodic, intimate, raw, textured\nTender Mexican heartbreak that feels simple and direct. Like admitting you’re not okay and brittle, but saying it softly so it doesn’t scare anyone.",
  "title: Your Love | artist: The Outfield | mood: nostalgic, energetic, uplifting | activity: driving, commuting, working out, late night | genre: rock, pop | vibe: retro, melodic, rhythmic, textured, expansive\nIconic 80s hook that hits instantly. Bright, driving energy that feels like cruising with the windows down and pretending you’re in a movie.",
  "title: Alone | artist: Heart | mood: melancholic, nostalgic, gritty | activity: late night, crying, reflecting, driving | genre: rock, pop | vibe: cinematic, expansive, melodic, raw, retro\nPower ballad drama that explodes with Ann's powerhouse voice. Big chorus and bigger feelings, like loneliness turning into something you can finally scream out.",
  "title: high road | artist: Kelly Clarkson | mood: uplifting, energetic, confident | activity: driving, working out, commuting, venting | genre: pop | vibe: expansive, cinematic, melodic, raw, textured\nPower-pop resilience that feels like choosing yourself out loud. Big chorus energy that turns frustration into forward motion.",
  "title: End Of Time | artist: Zara Larsson | mood: energetic, uplifting, warm | activity: driving, working out, late night, dancing | genre: pop, electronic | vibe: synthy, rhythmic, futuristic, layered, expansive\nUrgent pop rush that feels endless and electric. Like loving someone so loudly it stretches past the moment.",
  "title: Love Me Right | artist: Amber Mark | mood: warm, uplifting, confident | activity: cooking, driving, walking, relaxing | genre: r&b, pop | vibe: melodic, smooth, rhythmic, layered, warm\nSmooth, self-assured groove that feels grounded and cheeky. Calm confidence that doesn’t need to raise its voice.",
  "title: un x100to | artist: Grupo Frontera, Bad Bunny | mood: melancholic, nostalgic, dreamy | activity: late night, driving, reflecting, crying | genre: pop, latin | vibe: melodic, airy, intimate, textured, warm\nSoft heartbreak that sneaks up on you. Like missing someone quietly but deeply, replaying every almost-message.",
  "title: Dreamland | artist: Glass Animals | mood: dreamy, nostalgic, melancholic | activity: late night, daydreaming, reflecting, driving | genre: pop, electronic, alternative | vibe: hazy, layered, cinematic, textured, melodic\nFloating memories wrapped in soft distortion. Feels like looking back at youth through a warped but gentle lens.",
  "title: En El Coche | artist: Aitana | mood: uplifting, dreamy, energetic | activity: driving, commuting, late night, daydreaming | genre: pop | vibe: synthy, airy, rhythmic, layered, textured\nLight, breezy Spanish pop built for night drives. Feels like conversations that only happen when the city is quiet.",
  "title: Sunkissing | artist: Hailee Steinfeld | mood: warm, uplifting, dreamy | activity: walking, driving, daydreaming, cooking | genre: pop | vibe: airy, melodic, soft vocals, textured, warm\nGentle pop glow that feels like golden-hour skin. Easy, romantic, and effortlessly sweet.",
  "title: Jane Says | artist: Jane's Addiction | mood: gritty, melancholic, nostalgic | activity: late night, reflecting, driving, venting | genre: alternative, rock | vibe: raw, hypnotic, textured, minimal, retro\nUnsettling calm with a constant edge underneath. Feels like watching someone spiral while pretending everything’s fine.",
  "title: Liz | artist: Remi Wolf | mood: energetic, uplifting, chaotic | activity: driving, working out, late night, dancing | genre: pop, funk | vibe: chaotic, layered, rhythmic, textured, playful\nOff-the-wall pop funk that feels unhinged in the best way. Like letting your weirdness run the show.",
  "title: See The Light | artist: Stephen Sanchez | mood: warm, uplifting, nostalgic | activity: driving, relaxing, daydreaming, reflecting | genre: pop, soul | vibe: retro, melodic, soft vocals, romantic, warm\nOld-soul optimism wrapped in a modern sheen. Feels like believing in love again, slowly and timeless.",
  "title: Hey Girl | artist: Stephen Sanchez | mood: warm, dreamy, uplifting | activity: walking, driving, daydreaming, cooking | genre: pop, soul | vibe: retro, melodic, soft vocals, intimate, warm\nGentle romance with a vintage sway. Like a smile held a second too long.",
  "title: I Can See It In Your Eyes | artist: Men At Work | mood: nostalgic, energetic, warm | activity: driving, commuting, walking, late night | genre: rock, pop | vibe: retro, melodic, rhythmic, textured, warm\n80s charm with a knowing playfulness. Feels like realizing the truth before it’s ever said out loud.",
  "title: last time | artist: little luna | mood: melancholic, dreamy, nostalgic | activity: late night, reflecting, crying, daydreaming | genre: indie, pop | vibe: intimate, soft vocals, minimal, hazy, melodic\nQuiet sadness that feels personal and fragile. Like reliving a goodbye you weren’t ready for.",
  "title: Stairway to Heaven (Live At The Kennedy Center) | artist: Heart | mood: nostalgic, gritty, uplifting | activity: late night, reflecting, driving | genre: rock | vibe: cinematic, expansive, raw, melodic, epic\nGoosebump-inducing performance that feels sacred and holy. Power, respect, and emotional release all at once. Even better than the original",
  "title: UN DÍA (ONE DAY) | artist: J Balvin, Dua Lipa, Bad Bunny | mood: dreamy, melancholic, uplifting | activity: driving, late night, daydreaming | genre: pop, latin | vibe: airy, melodic, layered, textured, romantic\nSoft global pop longing that feels hopeful and sad at the same time. Like believing timing might still work out.",
  "title: October Passed Me By | artist: girl in red | mood: melancholic, nostalgic, dreamy | activity: late night, reflecting, crying, walking | genre: indie, pop | vibe: intimate, raw, soft vocals, minimal, moody\nQuiet grief that lingers without asking permission. Feels like missing someone long after you thought you’d healed.",
  "title: Mary Jane (All Night Long) | artist: Mary J. Blige | mood: warm, nostalgic, calm | activity: late night, relaxing, reflecting, driving | genre: r&b, soul | vibe: melodic, soft vocals, intimate, retro, layered\nSmooth, late-night R&B comfort. Feels like leaning into yourself when the world finally slows down.",
  "title: What It Is | artist: Amber Mark | mood: warm, uplifting, confident | activity: cooking, driving, walking | genre: r&b, pop | vibe: groovy, melodic, rhythmic, layered, warm\nEasy confidence and smooth groove. Feels like clarity after overthinking.",
  "title: Yonaguni | artist: Bad Bunny | mood: dreamy, melancholic, nostalgic | activity: late night, driving, reflecting, daydreaming | genre: latin, pop | vibe: airy, melodic, intimate, textured, moody\nSoft heartbreak wrapped in melody and distance. Like missing someone so much it becomes its own place.",
  "title: Mind Over Matter (Reprise) | artist: Young The Giant | mood: uplifting, nostalgic, melancholic | activity: driving, late night, reflecting | genre: indie, alternative | vibe: cinematic, expansive, melodic, textured, emotional\nSwelling release that feels earned. Like surviving something and realizing you’re still standing, while being hyper aware of your own humanity.",
  "title: Hold the Line | artist: TOTO | mood: energetic, uplifting, gritty | activity: driving, working out, commuting | genre: rock, pop | vibe: retro, rhythmic, melodic, textured, expansive\nClassic urgency with a timeless hook. Feels like pushing forward even when it’s uncomfortable.",
  "title: California | artist: Lorde | mood: nostalgic, melancholic, dreamy | activity: late night, reflecting, daydreaming, driving | genre: pop | vibe: cinematic, hazy, melodic, layered, textured\nBittersweet reflection on youth and illusion. Like realizing the dream didn’t save you, but it taught you something.",
  "title: Flaws | artist: Bastille | mood: melancholic, nostalgic, warm | activity: late night, reflecting, crying | genre: pop, alternative | vibe: acoustic, melodic, intimate, raw, minimal\nTender honesty that feels human and exposed. Like admitting love is messy but worth it.",
  "title: Oblivion | artist: Bastille | mood: melancholic, gritty, nostalgic | activity: late night, reflecting, driving | genre: pop, alternative | vibe: cinematic, textured, melodic, dark, expansive\nExtremely heavy emotions in polished production. Dan's voice conveys the deepest feelings of life being finite. Feels like standing still while the world moves on.",
  "title: Daniel In The Den | artist: Bastille | mood: energetic, gritty, uplifting | activity: working out, driving, venting | genre: pop, alternative | vibe: cinematic, rhythmic, layered, textured, dramatic\nHigh-stakes momentum with a dramatic edge. Feels like choosing courage when fear is louder."
]